// TODO: тут сделаем стору для создания/редактирования рецепта
// Данны будут совпадать с интерфейсом Recipe - как при отображении карточки рецепта
// Потом перед сохранением/редактированием будем форматировать данные в нужный вид

// Модалки для добавления ингридиента/категории и тд вынести в отдельные фичи

// Будет отдельная страница для создания рецепта и редактирования
// Обе страницы будут использовать одинаковый виджет, но разные методы
export { editRecipeStore } from './editRecipeStore'
